cf/Documents/КорректировкаДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаДолга</Name>
			<BasedOn>
				<xr:Item>Document.ОтгрузкаТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДолгДоКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтношений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаОтношений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоПартнеруСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартнерыСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияПереданныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоПартнеру</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОтношений</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормаОтношений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияПереданныхТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОтношений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаОтношений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/ФормаОтношений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ФормаОтношений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/КорректировкаДолга/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбщиеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Элементы.СтраницаВручную.Видимость 	= Не ПоПартнеруСписком;
	Элементы.СтраницаСписком.Видимость 	= ПоПартнеруСписком;
	Элементы.ГруппаПартнера.Видимость 	= ПоПартнеруСписком;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
	
	Сумма 			= ВзаиморасчетыПартнера.Итог("Сумма");	
	СуммаУпр	 	= ВзаиморасчетыПартнера.Итог("СуммаУпр");	
	Результат 		= ВзаиморасчетыПартнера.Итог("Результат");	
	РезультатУпр 	= ВзаиморасчетыПартнера.Итог("РезультатУпр");	
	
КонецПроцедуры 

#Область Типовые

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполним по умолчанию
	
	Если Объект.Ссылка.Пустая() Тогда ФункцииФормДокументов.ЗаполнитьЗначенияПоУмолчанию(ЭтаФорма, ЭтаФорма.Элементы) КонецЕсли;
	
	// Считаем партнеров
	
	ТаблПартнеров = Объект.ПоПартнеру.Выгрузить(,"Партнер");
	ТаблПартнеров.Свернуть("Партнер");
	Партнеры.Загрузить(ТаблПартнеров);
	
	// Обновим настройки и видимость
	
	ПоПартнеруСписком = Объект.ПоПартнеруСписком;
	ВзаиморасчетыПартнера.Загрузить(Объект.ПоПартнеру.Выгрузить());
	//ОбновитьВзаиморасчетыПартнера();
	
	// Видимость
	
	УправлениеВидимостьюДоступностью();
					
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Запустим в фоне определения долга
	
	ОбновитьИтоги();
	ОбновитьИнформациюОДолге();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ПоПартнеруСписком = ПоПартнеруСписком;
	
	ТекущийОбъект.ПоПартнеру.Очистить();
	Если ПоПартнеруСписком Тогда
		Для Каждого Строка ИЗ ВзаиморасчетыПартнера Цикл ЗаполнитьЗначенияСвойств(ТекущийОбъект.ПоПартнеру.Добавить(), Строка) КонецЦикла; КонецЕсли;
		
	// Если выбран партнер но по нему нет строк в основной таблице тогда добавим пустую строку для того чтобы видеть что мы с ним работали
	
	Для Каждого Строка Из Партнеры Цикл
		Если ТекущийОбъект.ПоПартнеру.Найти(Строка.Партнер, "Партнер") = Неопределено Тогда
			ТекущийОбъект.ПоПартнеру.Добавить().Партнер = Строка.Партнер; КонецЕсли; КонецЦикла;

	
	
	//корректируем пустые ссылки
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Заказ) и НЕ ТекущийОбъект.Заказ=Неопределено Тогда
		ТекущийОбъект.Заказ=Неопределено;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ДокументОтгрузки) и НЕ ТекущийОбъект.ДокументОтгрузки=Неопределено Тогда
		ТекущийОбъект.ДокументОтгрузки=Неопределено;
	КонецЕсли;
	
	Для Каждого Стр Из ТекущийОбъект.ПоПартнеру Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Заказ) и НЕ Стр.Заказ=Неопределено Тогда
			Стр.Заказ=Неопределено;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Стр.ДокументОтгрузки) и НЕ Стр.ДокументОтгрузки=Неопределено Тогда
			Стр.ДокументОтгрузки=Неопределено;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область Поток

&НаСервере
Функция ИнформацияПоДолгуПолучена()
	
	СтруктураДолга = ПолучитьИзВременногоХранилища(АдресИнфДолга);
	Если СтруктураДолга = Неопределено Тогда
		Возврат Ложь;
		
	Иначе
		
		Если СтруктураДолга.Состояние = Поток.СостояниеВыполнено() Тогда
			
			ИнфСтр1 = СтруктураДолга.Результат.Инф1;
			ИнфСтр2 = СтруктураДолга.Результат.Инф2;
			ИнфСтр3 = СтруктураДолга.Результат.Инф3; 
			
			// Заполним предыдущий долг конрагента пока документ не будет проведен
			Если Не Объект.Проведен Тогда Объект.ДолгДоКорректировки = СтруктураДолга.Результат.Сумма КонецЕсли;
			
			Элементы.ГруппаИнфоТовара.Видимость = Истина;
			
		ИначеЕсли СтруктураДолга.Состояние = Поток.СостояниеОшибка() Тогда
			
			ОбщиеФункции.СообщитьТекст(СтруктураДолга.стрОшибки); КонецЕсли;
		
		Возврат Истина; КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура ПолучитьИнфОДолгеПостоянно()
	
	Если ИнформацияПоДолгуПолучена() Тогда
		ОтключитьОбработчикОжидания("ПолучитьИнфОДолгеПостоянно"); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПолучитьИнфОДолге()
	
	Если Не ИнформацияПоДолгуПолучена() Тогда
		ПодключитьОбработчикОжидания("ПолучитьИнфОДолгеПостоянно", 1) КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьИнформациюОДолге()
	
	CRMКлиент.ИнформацияОДолгеНачало(ИнфСтр1, ИнфСтр2, ИнфСтр3);
	
	АдресИнфДолга = Поток.СобратьИнформациюОДолгеВФоне(Объект.Контрагент, УникальныйИдентификатор, Объект.ФормаОтношений);
	ПодключитьОбработчикОжидания("ПолучитьИнфОДолге", 0.1, Истина);
	
КонецПроцедуры
&НаКлиенте
Процедура ИнфСтрОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	CRMКлиент.ОбработатьНавигационнуюСсылку(НавигационнаяСсылка, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Реквизиты

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере() Экспорт
	
	ФункцииФормДокументов.ОрганизацияПриИзменении(Объект);

КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	
	ОрганизацияПриИзмененииНаСервере();
	ОбновитьИнформациюОДолге();
	
КонецПроцедуры
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	ФункцииФормДокументов.КонтрагентПриИзменении(Объект);
	
КонецПроцедуры
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	ОбновитьИнформациюОДолге();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОтношенийПриИзменении(Элемент)
	
	ОбновитьИнформациюОДолге();
	
	Элементы.Заказ.Видимость = ?(Объект.ФормаОтношений=ПредопределенноеЗначение("Перечисление.ФормаОтношений.Клиент"),Истина,Ложь);
	Элементы.ДокументОтгрузки.Видимость = ?(Объект.ФормаОтношений=ПредопределенноеЗначение("Перечисление.ФормаОтношений.Клиент"),Истина,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоПартнеруСпискомПриИзменении(Элемент)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры



#КонецОбласти

#Область Работа_со_списком

&НаСервере
Процедура ОбновитьВзаиморасчетыПартнера()
	
	// Соединяем что в таблице с остаткми в базе и выводим результат
	
	Запрос = Новый Запрос(СтрШаблон("
	|ВЫБРАТЬ Табл.Партнер, Табл.Контрагент, Табл.Организация, Табл.ФормаОтношений, Табл.Заказ, Табл.ДокументОтгрузки, Табл.Сумма, Табл.СуммаУпр ПОМЕСТИТЬ ТаблДока ИЗ &ТаблицаДока КАК Табл;
	|ВЫБРАТЬ 
	|	ЕСТЬNULL(Док.Партнер, 			Рег.Партнер) 		Партнер, 
	|	ЕСТЬNULL(Док.Контрагент, 		Рег.Контрагент) 	Контрагент, 
	|	ЕСТЬNULL(Док.Организация, 		Рег.Организация) 	Организация,
	|	ЕСТЬNULL(Док.ФормаОтношений, 	Рег.ФормаОтношений) ФормаОтношений, 
	|	ЕСТЬNULL(Док.Заказ, 			Неопределено) Заказ, 
	|	ЕСТЬNULL(Док.ДокументОтгрузки, 	Неопределено) ДокументОтгрузки, 
	|	ЕСТЬNULL(СуммаОстаток, 0) 		Остаток, 
	|	ЕСТЬNULL(СуммаУпрОстаток, 0) 	ОстатокУпр,
	|	ЕСТЬNULL(Док.Сумма, 0) 			Сумма, 
	|	ЕСТЬNULL(Док.СуммаУпр, 0),		СуммаУпр,
	|	ЕСТЬNULL(СуммаОстаток, 0) + ЕСТЬNULL(Док.Сумма, 0) 			Результат,
	|	ЕСТЬNULL(СуммаУпрОстаток, 0) + ЕСТЬNULL(Док.СуммаУпр, 0) 	РезультатУпр
	|ИЗ 
	|	РегистрНакопления.Взаиморасчеты.Остатки(%1, Партнер В(&Партнеры)) Рег
	|
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	ТаблДока Док
	|ПО
	|	Док.Партнер 		= Рег.Партнер И
	|	Док.Контрагент 		= Рег.Контрагент И
	|	Док.Организация 	= Рег.Организация И
	|	Док.ФормаОтношений 	= Рег.ФормаОтношений
	|
	|", ?(Объект.Ссылка.Пустая(), "", "&ДатаДок")));
	
	Запрос.УстановитьПараметр("ДатаДок", 		Объект.Дата);
	Запрос.УстановитьПараметр("Партнеры", 		Партнеры.Выгрузить().ВыгрузитьКолонку("Партнер"));
	Запрос.УстановитьПараметр("ТаблицаДока", 	ВзаиморасчетыПартнера.Выгрузить());
	
	
	ВзаиморасчетыПартнера.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	//ВзаиморасчетыПартнера.Очистить();
	//ОбновитьВзаиморасчетыПартнера();
	
КонецПроцедуры

&НаКлиенте
Процедура ВзаиморасчетыПартнераСуммаПриИзменении(Элемент)
	
	текДанные = Элементы.ВзаиморасчетыПартнера.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		текДанные.Результат = текДанные.Остаток + текДанные.Сумма;
		ОбновитьИтоги(); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ВзаиморасчетыПартнераРезультатСуммаПриИзменении(Элемент)
	
	текДанные = Элементы.ВзаиморасчетыПартнера.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		текДанные.Сумма = текДанные.Результат - текДанные.Остаток;
		ОбновитьИтоги(); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ВзаиморасчетыПартнераСуммаУпрПриИзменении(Элемент)
	
	текДанные = Элементы.ВзаиморасчетыПартнера.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		текДанные.РезультатУпр = текДанные.ОстатокУпр + текДанные.СуммаУпр;
		ОбновитьИтоги(); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ВзаиморасчетыПартнераРезультатСуммаУпрПриИзменении(Элемент)
	
	текДанные = Элементы.ВзаиморасчетыПартнера.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		текДанные.СуммаУпр = текДанные.РезультатУпр - текДанные.ОстатокУпр; 
		ОбновитьИтоги(); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Взаиморасчеты(Команда)
	
	СписокПартнеров = Новый Массив;
	Для каждого Строка Из Партнеры Цикл Если СписокПартнеров.Найти(Строка.Партнер) = Неопределено Тогда СписокПартнеров.Добавить(Строка.Партнер) КонецЕсли; КонецЦикла;
	
		ОткрытьФорму("Отчет.Взаиморасчеты.ФормаОбъекта", Новый Структура("СформироватьПриОткрытии, Отбор", Истина, Новый Структура("Партнер", СписокПартнеров)), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Обнулить(Команда)
	
	Для Каждого Строка ИЗ ВзаиморасчетыПартнера Цикл 
		Строка.Результат = 0; 		Строка.Сумма = Строка.Остаток * -1;
		Строка.РезультатУпр = 0; 	Строка.СуммаУпр = Строка.ОстатокУпр * -1; КонецЦикла;
	
	ОбновитьИтоги();
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//ОбновитьВзаиморасчетыПартнера();
	ОбновитьИтоги();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	//ОбновитьВзаиморасчетыПартнера();
	ОбновитьИтоги();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	текПартнер = Элементы.Партнеры.ТекущиеДанные.Партнер;
	//ОбновитьВзаиморасчетыПартнера();
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерыПриАктивизацииСтроки(Элемент)
	
	текДанные = Элементы.Партнеры.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		текПартнер = текДанные.Партнер; 
		//Элементы.ВзаиморасчетыПартнера.Обновить(); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
